{
  "facts": [
    {"id":"fact-001","topic":"Citizen Kane","title":"Hearst Tried to Bury It","body":"William Randolph Hearst used his media empire to suppress coverage of Citizen Kane in 1941. RKO theaters were pressured, and critics were intimidated. The backlash helped cement Kane's rebel aura.","tags":["GoldenAge","ProductionLore"]},
    {"id":"fact-002","topic":"Psycho Shower Scene","title":"Chocolate Syrup Blood","body":"The blood in Psycho's shower scene was actually Bosco chocolate syrup. Black-and-white stock made it read as visceral blood on camera. Hitchcock also used dozens of cuts to trick viewers into feeling a stab that is never shown.","tags":["CineTech","DirectorLore"]},
    {"id":"fact-003","topic":"Casablanca","title":"Ending Written During Production","body":"Casablanca's final ending was still in flux while shooting. Ingrid Bergman did not know which man Ilsa would choose. That uncertainty leaks into her performance and gave the romance its floating ache.","tags":["GoldenAge","ProductionLore"]},
    {"id":"fact-004","topic":"Jaws","title":"The Shark Broke, The Movie Improved","body":"The mechanical shark on Jaws failed constantly in salt water. Spielberg shifted to suggestion, point-of-view shots, and John Williams cues. The restraint became a blueprint for suspense filmmaking.","tags":["ProductionLore","BoxOffice"]},
    {"id":"fact-005","topic":"The Godfather","title":"The Studio Didn't Want Pacino","body":"Paramount executives pushed against Al Pacino as Michael Corleone. Coppola fought for him through daily pressure and threats of replacement. Pacino's slow-burn transformation became the spine of the film.","tags":["DirectorLore","ProductionLore"]},
    {"id":"fact-006","topic":"Technicolor","title":"Three Cameras, One Image","body":"Early three-strip Technicolor cameras split light into red, green, and blue records simultaneously. The rigs were giant, hot, and expensive to run. But the color richness changed audience expectations overnight.","tags":["CineTech","GoldenAge"]},
    {"id":"fact-007","topic":"Metropolis","title":"Nearly Lost, Then Rebuilt","body":"Fritz Lang's Metropolis was heavily cut after premiere and survived for decades in mutilated form. A key 16mm print discovered in Argentina restored missing story lines in 2008. Film history literally changed with one archive find.","tags":["SilentEra","WorldCinema"]},
    {"id":"fact-008","topic":"Tokyo Story","title":"Ozu Barely Moves the Camera","body":"Yasujiro Ozu shot many scenes from low, tatami-height compositions. He avoided dramatic camera moves and leaned on rhythm, stillness, and ellipses. The style turns ordinary family moments into quiet existential shocks.","tags":["WorldCinema","DirectorLore"]},
    {"id":"fact-009","topic":"2001: A Space Odyssey","title":"Front Projection Moon Magic","body":"Kubrick used front projection with giant reflective screens to create prehistoric landscapes. The process delivered surreal depth and sharpness impossible with rear projection. It remains one of cinema's great practical illusions.","tags":["CineTech","DirectorLore"]},
    {"id":"fact-010","topic":"Gone with the Wind","title":"Premiere as Civic Event","body":"Atlanta's 1939 premiere of Gone with the Wind became a regional spectacle with parades and closed schools. The film fused Hollywood marketing with historical mythmaking. It showed studios could sell movies as national events.","tags":["GoldenAge","BoxOffice"]},
    {"id":"fact-011","topic":"Star Wars","title":"Merchandise Changed the Business","body":"George Lucas negotiated to keep Star Wars merchandising rights when many executives underestimated toy value. The deal generated a licensing empire beyond box office returns. Franchise economics were never the same.","tags":["BoxOffice","ProductionLore"]},
    {"id":"fact-012","topic":"The Wizard of Oz","title":"Toto Earned More Than Munchkins","body":"Reports from production accounting suggest Toto was paid more weekly than many Munchkin performers. Studio-era payroll reflected hierarchy and novelty value as much as screen time. Even in Oz, labor politics were real.","tags":["GoldenAge","ProductionLore"]},
    {"id":"fact-013","topic":"Lawrence of Arabia","title":"Desert Light as Character","body":"Freddie Young embraced harsh desert daylight instead of hiding from it. Wide Super Panavision compositions transformed geography into psychology. The film's scale is a lesson in using location as narrative force.","tags":["CineTech","GoldenAge"]},
    {"id":"fact-014","topic":"The Blair Witch Project","title":"Microbudget, Macro Myth","body":"The Blair Witch Project used faux-documentary framing and online lore years before social virality became standard. Viewers arrived unsure what was real. Its campaign proved framing can be as powerful as production spend.","tags":["ProductionLore","BoxOffice"]},
    {"id":"fact-015","topic":"Rashomon","title":"Truth Splintered On Purpose","body":"Kurosawa and writer Shinobu Hashimoto built Rashomon around conflicting testimony long before the phrase truth is subjective became a media cliché. The film gave criticism a new verb: the Rashomon effect. Form and theme became inseparable.","tags":["WorldCinema","DirectorLore"]},
    {"id":"fact-016","topic":"Nosferatu","title":"A Lawsuit Couldn't Kill the Vampire","body":"Bram Stoker's estate won a lawsuit against Nosferatu and ordered prints destroyed. Surviving copies circulated anyway and preserved Murnau's shadow nightmare. Bootleg survival saved a cornerstone of horror cinema.","tags":["SilentEra","ProductionLore"]},
    {"id":"fact-017","topic":"Singin' in the Rain","title":"A Musical About Sound Panic","body":"Singin' in the Rain is a joyful comedy built on a brutal industrial transition. Studios dumped silent stars whose voices did not fit new recording standards. The movie is both parody and confession.","tags":["GoldenAge","CineTech"]},
    {"id":"fact-018","topic":"Do the Right Thing","title":"Color Temperature as Politics","body":"Ernest Dickerson and Spike Lee pushed warm, saturated reds and yellows to make heat feel oppressive. The palette turns weather into social pressure. Every frame sweats before anyone speaks.","tags":["CineTech","DirectorLore"]},
    {"id":"fact-019","topic":"Chungking Express","title":"Step-Printing Heartbreak","body":"Christopher Doyle used step-printing and shutter tricks to blur motion in Chungking Express. Time feels smeared, anxious, and romantic all at once. Wong Kar-wai made longing look like neon turbulence.","tags":["WorldCinema","CineTech"]},
    {"id":"fact-020","topic":"The Exorcist","title":"Set Refrigerated for Breath","body":"The Exorcist crew refrigerated Regan's bedroom set to capture visible breath. Temperatures dropped so low that equipment and performers suffered physically. Friedkin chased realism through controlled misery.","tags":["ProductionLore","DirectorLore"]},
    {"id":"fact-021","topic":"Buster Keaton","title":"Stone Face, Deadly Precision","body":"Buster Keaton performed high-risk stunts with geometric precision and minimal doubles. In Steamboat Bill, Jr., a building facade fell around him through a tiny window gap. Silent comedy was engineered danger.","tags":["SilentEra","CineTech"]},
    {"id":"fact-022","topic":"Alien","title":"Chestburster Secrecy","body":"Ridley Scott kept the full chestburster effect hidden from much of the cast before filming. Their shock on camera is partly genuine. Controlled secrecy became a performance tool.","tags":["ProductionLore","DirectorLore"]},
    {"id":"fact-023","topic":"Bicycle Thieves","title":"Non-Actors, Maximum Impact","body":"De Sica cast many non-professional actors to preserve postwar texture in Bicycle Thieves. Faces and streets carry documentary weight without documentary form. Neorealism turned scarcity into style.","tags":["WorldCinema","GoldenAge"]},
    {"id":"fact-024","topic":"The Matrix","title":"Bullet Time Was Hardware + Choreography","body":"Bullet time combined still-camera arrays, precise timing, and digital interpolation. It was not one trick but a coordination problem across departments. The result redefined action grammar for a decade.","tags":["CineTech","ProductionLore"]},
    {"id":"fact-025","topic":"Pulp Fiction","title":"Festival Win to Cultural Flood","body":"Pulp Fiction's Palme d'Or win turned a sharp indie voice into mainstream obsession. Its chapter structure and soundtrack curation became endlessly imitated. Sundance-era independence collided with global pop culture.","tags":["NewHollywood","BoxOffice"]},
    {"id":"fact-026","topic":"Rear Window","title":"Courtyard as Studio Machine","body":"Rear Window's apartment courtyard was one of Paramount's largest interior sets. Lighting had to mimic time-of-day transitions across dozens of windows. Hitchcock built an urban ecosystem under one roof.","tags":["CineTech","GoldenAge"]},
    {"id":"fact-027","topic":"Apocalypse Now","title":"Production Chaos Became Myth","body":"Typhoons, budget overruns, a heart attack, and endless rewrites nearly destroyed Apocalypse Now. Coppola described the shoot as mirroring the film's descent into madness. The making-of narrative became part of the artwork.","tags":["NewHollywood","ProductionLore"]},
    {"id":"fact-028","topic":"Moonlight","title":"Small Budget, Huge Precision","body":"Moonlight was made for a fraction of typical studio drama budgets. Its intimacy comes from deliberate color control, close framing, and a triptych structure. Craft, not scale, made it monumental.","tags":["Contemporary","CineTech"]},
    {"id":"fact-029","topic":"Vertigo","title":"The Dolly Zoom's Psychological Punch","body":"Hitchcock's Vertigo popularized the dolly zoom to visualize acrophobia. Tracking in while zooming out fractures spatial certainty. A camera move became a feeling.","tags":["CineTech","DirectorLore"]},
    {"id":"fact-030","topic":"Seven Samurai","title":"Rain as Dramatic Texture","body":"Kurosawa staged the final battle in heavy rain to amplify movement and chaos. Mud, weather, and physical strain become narrative stakes. Action cinema still borrows that elemental intensity.","tags":["WorldCinema","DirectorLore"]}
  ],
  "lore": [
    {"id":"lore-001","title":"Orson Welles vs RKO's Nervous Executives","body":"After Citizen Kane, Welles delivered The Magnificent Ambersons into a studio climate terrified by wartime testing and exhibitor pressure. RKO cut the film while Welles was away and discarded the removed footage. It's one of the great irreversible losses in American cinema.","era":"1940s","tags":["GoldenAge","DirectorLore"]},
    {"id":"lore-002","title":"Bette Davis Took Warner Bros to Court","body":"In 1936, Bette Davis sued Warner Bros in England trying to break her restrictive contract. She lost, but the case exposed studio labor control and inspired later talent revolts. Her defiance became industry legend.","era":"1930s","tags":["GoldenAge","ProductionLore"]},
    {"id":"lore-003","title":"Erich von Stroheim, The Original Final-Cut Casualty","body":"Von Stroheim's Greed was cut from an epic version to a far shorter release demanded by MGM. Stories of the lost cut haunted cinephiles for generations. The clash set an early pattern for auteur vs studio warfare.","era":"1920s","tags":["SilentEra","DirectorLore"]},
    {"id":"lore-004","title":"The Cleopatra Budget Spiral","body":"Cleopatra (1963) became synonymous with runaway production costs, location changes, and headline-making delays. Its expense nearly wrecked 20th Century Fox. One film helped accelerate the end of old studio certainties.","era":"1960s","tags":["BoxOffice","ProductionLore"]},
    {"id":"lore-005","title":"Brando's Cue Card Maze","body":"Marlon Brando was notorious for using hidden cue cards in later productions, sometimes placed on props and co-stars. Directors alternated between frustration and accommodation. His unpredictability fed both myth and management nightmares.","era":"1970s","tags":["DirectorLore","ProductionLore"]},
    {"id":"lore-006","title":"Kubrick's Endless Takes on The Shining","body":"Shelley Duvall and crew endured famously high take counts during The Shining. Kubrick treated repetition as excavation, searching for tiny shifts in performance rhythm. The result remains a case study in perfectionism and cost.","era":"1980s","tags":["DirectorLore","ProductionLore"]},
    {"id":"lore-007","title":"Chaplin's Political Exile","body":"Charlie Chaplin's image shifted from beloved clown to political target in Cold War America. Re-entry restrictions and pressure campaigns pushed him to live in Switzerland. Hollywood's relationship with dissent was never simple.","era":"1950s","tags":["GoldenAge","ProductionLore"]},
    {"id":"lore-008","title":"Joan Crawford vs Bette Davis, Rivalry as Public Spectacle","body":"Their antagonism, amplified by studio publicity machines, became a serialized drama off-screen. Feud narratives sold tickets by extending story worlds into gossip columns. Persona was an industrial product.","era":"1940s","tags":["GoldenAge","DirectorLore"]},
    {"id":"lore-009","title":"Heaven's Gate and the Auteur Reckoning","body":"Michael Cimino's Heaven's Gate ballooned in cost and production time, then opened to hostile reactions. The fiasco hardened studio skepticism toward unchecked director power. New Hollywood's romantic era closed fast.","era":"1980s","tags":["BoxOffice","NewHollywood"]},
    {"id":"lore-010","title":"The Day the Blacklist Became Real","body":"The Hollywood Ten hearings transformed political anxiety into formal labor punishment. Careers were destroyed, pseudonyms proliferated, and scripts circulated through fronts. The blacklist still shadows debates about artistic freedom.","era":"1940s","tags":["GoldenAge","ProductionLore"]},
    {"id":"lore-011","title":"Hitchcock and Tippi Hedren's Fracture","body":"Stories from The Birds and Marnie productions describe a deeply controlling dynamic that later turned publicly contentious. Hedren's career opportunities reportedly narrowed during contract conflicts. The saga recontextualizes auteur glamour.","era":"1960s","tags":["DirectorLore","ProductionLore"]},
    {"id":"lore-012","title":"The Island of Dr. Moreau Meltdown","body":"The 1996 Dr. Moreau production saw director replacement, cast tensions, and chaotic set behavior become tabloid material. Finished scenes carry that disorder onscreen. It is pure cautionary tale cinema.","era":"1990s","tags":["ProductionLore","Contemporary"]},
    {"id":"lore-013","title":"Fritz Lang Walked Out on Goebbels","body":"Lang later claimed Nazi propaganda minister Joseph Goebbels invited him to lead German film production. Lang said he fled that night. Historians debate details, but the story endures as cinema lore of moral escape.","era":"1930s","tags":["WorldCinema","DirectorLore"]},
    {"id":"lore-014","title":"Maria Schneider and Last Tango Backlash","body":"Last Tango in Paris became notorious not only for explicitness but for later debates around consent and directorial ethics. The conversation shifted from scandal to accountability over decades. Film history keeps reopening this wound.","era":"1970s","tags":["WorldCinema","ProductionLore"]},
    {"id":"lore-015","title":"Lost London After Midnight","body":"Tod Browning's London After Midnight is one of the most sought-after lost films in American archives. A vault fire erased known prints, leaving stills and legends. Absence itself turned the movie into myth.","era":"1920s","tags":["SilentEra","ProductionLore"]}
  ],
  "directors": [
    {"id":138,"name":"Christopher Nolan","era":"Contemporary","funFact":"Nolan prefers practical effects and large-format photography whenever possible."},
    {"id":525,"name":"Christopher McQuarrie","era":"Contemporary","funFact":"McQuarrie frequently rewrites during production around stunts and location constraints."},
    {"id":5655,"name":"Francis Ford Coppola","era":"New Hollywood","funFact":"Coppola's Zoetrope dream was to merge art-house risk with studio-scale resources."},
    {"id":578,"name":"Steven Spielberg","era":"New Hollywood","funFact":"Spielberg's blocking often hides narrative information in deep frame layers."},
    {"id":2636,"name":"Alfred Hitchcock","era":"Golden Age","funFact":"Hitchcock storyboarded extensively and viewed shooting as executing a solved puzzle."},
    {"id":1032,"name":"Martin Scorsese","era":"New Hollywood","funFact":"Scorsese's cinephilia directly fed preservation work through The Film Foundation."},
    {"id":1223,"name":"David Lean","era":"Golden Age","funFact":"Lean's training as an editor sharpened his sense of narrative scale and rhythm."},
    {"id":1243,"name":"Akira Kurosawa","era":"Golden Age","funFact":"Kurosawa painted storyboards like full artworks before production began."},
    {"id":13890,"name":"Billy Wilder","era":"Golden Age","funFact":"Wilder's scripts are famous for razor-sharp structural setups and payoffs."},
    {"id":190,"name":"Quentin Tarantino","era":"Contemporary","funFact":"Tarantino writes by hand first, then shapes dialogue rhythm through table reads."},
    {"id":2231,"name":"Stanley Kubrick","era":"New Hollywood","funFact":"Kubrick developed custom lenses and modified camera systems for extreme low light."},
    {"id":1675,"name":"John Ford","era":"Golden Age","funFact":"Ford often pre-edited in camera, limiting studio options in post."},
    {"id":20991,"name":"Agnès Varda","era":"Contemporary","funFact":"Varda blended documentary textures with playful formal experimentation."},
    {"id":7467,"name":"Satyajit Ray","era":"Golden Age","funFact":"Ray designed posters and calligraphy for his own films."},
    {"id":4037,"name":"Bong Joon-ho","era":"Contemporary","funFact":"Bong maps spatial class relationships before writing key scenes."},
    {"id":2725,"name":"Denis Villeneuve","era":"Contemporary","funFact":"Villeneuve often uses sound design as narrative architecture."},
    {"id":805,"name":"Robert Altman","era":"New Hollywood","funFact":"Altman popularized layered overlapping dialogue in ensemble scenes."},
    {"id":1081,"name":"Wes Anderson","era":"Contemporary","funFact":"Anderson's framing grammar borrows from illustration and miniature craft."},
    {"id":514,"name":"Federico Fellini","era":"Golden Age","funFact":"Fellini fused circus memory and dream logic into autobiographical spectacle."},
    {"id":1264,"name":"Ingmar Bergman","era":"Golden Age","funFact":"Bergman's repertory collaborators created one of cinema's richest actor-director ecosystems."}
  ],
  "filmOfDay": [
    {"title":"Citizen Kane","year":1941,"director":"Orson Welles","tmdbId":15},
    {"title":"Casablanca","year":1942,"director":"Michael Curtiz","tmdbId":289},
    {"title":"The Third Man","year":1949,"director":"Carol Reed","tmdbId":1092},
    {"title":"Sunset Boulevard","year":1950,"director":"Billy Wilder","tmdbId":599},
    {"title":"Rashomon","year":1950,"director":"Akira Kurosawa","tmdbId":548},
    {"title":"Singin' in the Rain","year":1952,"director":"Gene Kelly & Stanley Donen","tmdbId":872},
    {"title":"Tokyo Story","year":1953,"director":"Yasujiro Ozu","tmdbId":18148},
    {"title":"Rear Window","year":1954,"director":"Alfred Hitchcock","tmdbId":567},
    {"title":"Seven Samurai","year":1954,"director":"Akira Kurosawa","tmdbId":346},
    {"title":"The Night of the Hunter","year":1955,"director":"Charles Laughton","tmdbId":3112},
    {"title":"The Searchers","year":1956,"director":"John Ford","tmdbId":3114},
    {"title":"The Seventh Seal","year":1957,"director":"Ingmar Bergman","tmdbId":490},
    {"title":"Vertigo","year":1958,"director":"Alfred Hitchcock","tmdbId":426},
    {"title":"Some Like It Hot","year":1959,"director":"Billy Wilder","tmdbId":239},
    {"title":"Breathless","year":1960,"director":"Jean-Luc Godard","tmdbId":703},
    {"title":"Psycho","year":1960,"director":"Alfred Hitchcock","tmdbId":539},
    {"title":"La Dolce Vita","year":1960,"director":"Federico Fellini","tmdbId":937},
    {"title":"Lawrence of Arabia","year":1962,"director":"David Lean","tmdbId":947},
    {"title":"8 1/2","year":1963,"director":"Federico Fellini","tmdbId":422},
    {"title":"The Leopard","year":1963,"director":"Luchino Visconti","tmdbId":445},
    {"title":"Persona","year":1966,"director":"Ingmar Bergman","tmdbId":797},
    {"title":"The Good, the Bad and the Ugly","year":1966,"director":"Sergio Leone","tmdbId":429},
    {"title":"Bonnie and Clyde","year":1967,"director":"Arthur Penn","tmdbId":475},
    {"title":"2001: A Space Odyssey","year":1968,"director":"Stanley Kubrick","tmdbId":62},
    {"title":"Once Upon a Time in the West","year":1968,"director":"Sergio Leone","tmdbId":335},
    {"title":"The Godfather","year":1972,"director":"Francis Ford Coppola","tmdbId":238},
    {"title":"The Exorcist","year":1973,"director":"William Friedkin","tmdbId":9552},
    {"title":"The Conversation","year":1974,"director":"Francis Ford Coppola","tmdbId":592},
    {"title":"Chinatown","year":1974,"director":"Roman Polanski","tmdbId":829},
    {"title":"Jaws","year":1975,"director":"Steven Spielberg","tmdbId":578},
    {"title":"Taxi Driver","year":1976,"director":"Martin Scorsese","tmdbId":103},
    {"title":"Network","year":1976,"director":"Sidney Lumet","tmdbId":10774},
    {"title":"Star Wars","year":1977,"director":"George Lucas","tmdbId":11},
    {"title":"Close Encounters of the Third Kind","year":1977,"director":"Steven Spielberg","tmdbId":840},
    {"title":"Days of Heaven","year":1978,"director":"Terrence Malick","tmdbId":16619},
    {"title":"Alien","year":1979,"director":"Ridley Scott","tmdbId":348},
    {"title":"Apocalypse Now","year":1979,"director":"Francis Ford Coppola","tmdbId":28},
    {"title":"Raging Bull","year":1980,"director":"Martin Scorsese","tmdbId":1578},
    {"title":"Blade Runner","year":1982,"director":"Ridley Scott","tmdbId":78},
    {"title":"Fanny and Alexander","year":1982,"director":"Ingmar Bergman","tmdbId":5961},
    {"title":"Paris, Texas","year":1984,"director":"Wim Wenders","tmdbId":655},
    {"title":"Ran","year":1985,"director":"Akira Kurosawa","tmdbId":11645},
    {"title":"Blue Velvet","year":1986,"director":"David Lynch","tmdbId":793},
    {"title":"Wings of Desire","year":1987,"director":"Wim Wenders","tmdbId":12508},
    {"title":"Do the Right Thing","year":1989,"director":"Spike Lee","tmdbId":925},
    {"title":"Goodfellas","year":1990,"director":"Martin Scorsese","tmdbId":769},
    {"title":"The Silence of the Lambs","year":1991,"director":"Jonathan Demme","tmdbId":274},
    {"title":"Unforgiven","year":1992,"director":"Clint Eastwood","tmdbId":33},
    {"title":"The Piano","year":1993,"director":"Jane Campion","tmdbId":713},
    {"title":"Chungking Express","year":1994,"director":"Wong Kar-wai","tmdbId":11104},
    {"title":"Pulp Fiction","year":1994,"director":"Quentin Tarantino","tmdbId":680},
    {"title":"Heat","year":1995,"director":"Michael Mann","tmdbId":949},
    {"title":"Se7en","year":1995,"director":"David Fincher","tmdbId":807},
    {"title":"Fargo","year":1996,"director":"Joel Coen","tmdbId":275},
    {"title":"Princess Mononoke","year":1997,"director":"Hayao Miyazaki","tmdbId":128},
    {"title":"Boogie Nights","year":1997,"director":"Paul Thomas Anderson","tmdbId":4995},
    {"title":"The Big Lebowski","year":1998,"director":"Joel Coen","tmdbId":115},
    {"title":"The Matrix","year":1999,"director":"Lana & Lilly Wachowski","tmdbId":603},
    {"title":"In the Mood for Love","year":2000,"director":"Wong Kar-wai","tmdbId":843},
    {"title":"Mulholland Drive","year":2001,"director":"David Lynch","tmdbId":1018},
    {"title":"Spirited Away","year":2001,"director":"Hayao Miyazaki","tmdbId":129},
    {"title":"City of God","year":2002,"director":"Fernando Meirelles","tmdbId":598},
    {"title":"There Will Be Blood","year":2007,"director":"Paul Thomas Anderson","tmdbId":7345},
    {"title":"No Country for Old Men","year":2007,"director":"Joel & Ethan Coen","tmdbId":6977},
    {"title":"The Dark Knight","year":2008,"director":"Christopher Nolan","tmdbId":155},
    {"title":"WALL-E","year":2008,"director":"Andrew Stanton","tmdbId":10681},
    {"title":"Inglourious Basterds","year":2009,"director":"Quentin Tarantino","tmdbId":16869},
    {"title":"A Separation","year":2011,"director":"Asghar Farhadi","tmdbId":60243},
    {"title":"The Tree of Life","year":2011,"director":"Terrence Malick","tmdbId":8967},
    {"title":"The Master","year":2012,"director":"Paul Thomas Anderson","tmdbId":68718},
    {"title":"Inside Llewyn Davis","year":2013,"director":"Coen Brothers","tmdbId":86834},
    {"title":"Mad Max: Fury Road","year":2015,"director":"George Miller","tmdbId":76341},
    {"title":"Carol","year":2015,"director":"Todd Haynes","tmdbId":258480},
    {"title":"Moonlight","year":2016,"director":"Barry Jenkins","tmdbId":376867},
    {"title":"The Handmaiden","year":2016,"director":"Park Chan-wook","tmdbId":290098},
    {"title":"Get Out","year":2017,"director":"Jordan Peele","tmdbId":419430},
    {"title":"Phantom Thread","year":2017,"director":"Paul Thomas Anderson","tmdbId":400617},
    {"title":"Roma","year":2018,"director":"Alfonso Cuarón","tmdbId":426426},
    {"title":"Portrait of a Lady on Fire","year":2019,"director":"Céline Sciamma","tmdbId":531428},
    {"title":"Parasite","year":2019,"director":"Bong Joon-ho","tmdbId":496243},
    {"title":"The Irishman","year":2019,"director":"Martin Scorsese","tmdbId":398978},
    {"title":"Memoria","year":2021,"director":"Apichatpong Weerasethakul","tmdbId":653612},
    {"title":"Drive My Car","year":2021,"director":"Ryusuke Hamaguchi","tmdbId":718930},
    {"title":"Aftersun","year":2022,"director":"Charlotte Wells","tmdbId":965150},
    {"title":"Tár","year":2022,"director":"Todd Field","tmdbId":817758},
    {"title":"Decision to Leave","year":2022,"director":"Park Chan-wook","tmdbId":705996},
    {"title":"Past Lives","year":2023,"director":"Celine Song","tmdbId":666277},
    {"title":"The Zone of Interest","year":2023,"director":"Jonathan Glazer","tmdbId":467244},
    {"title":"Anatomy of a Fall","year":2023,"director":"Justine Triet","tmdbId":915935},
    {"title":"All That Jazz","year":1979,"director":"Bob Fosse","tmdbId":16858},
    {"title":"The Red Shoes","year":1948,"director":"Michael Powell & Emeric Pressburger","tmdbId":19494},
    {"title":"Ace in the Hole","year":1951,"director":"Billy Wilder","tmdbId":381},
    {"title":"The Passion of Joan of Arc","year":1928,"director":"Carl Theodor Dreyer","tmdbId":780},
    {"title":"Man with a Movie Camera","year":1929,"director":"Dziga Vertov","tmdbId":11323},
    {"title":"M","year":1931,"director":"Fritz Lang","tmdbId":832},
    {"title":"L'Atalante","year":1934,"director":"Jean Vigo","tmdbId":15864},
    {"title":"Children of Paradise","year":1945,"director":"Marcel Carné","tmdbId":28923},
    {"title":"Ugetsu","year":1953,"director":"Kenji Mizoguchi","tmdbId":15497},
    {"title":"The 400 Blows","year":1959,"director":"François Truffaut","tmdbId":147},
    {"title":"Yojimbo","year":1961,"director":"Akira Kurosawa","tmdbId":11878},
    {"title":"Le Samouraï","year":1967,"director":"Jean-Pierre Melville","tmdbId":5511}
  ],
  "deepDiveTopics": [
    "How Hitchcock invented the modern thriller",
    "The rise and fall of the Hollywood studio system",
    "Why Technicolor changed everything",
    "The economics of the first blockbuster era",
    "How noir reshaped postwar American cinema",
    "The making of New Hollywood in the 1970s",
    "Why Italian Neorealism still matters",
    "Akira Kurosawa's influence on global action cinema",
    "How editing evolved from Soviet montage to MTV pacing",
    "The invention of the movie star as an industrial product",
    "The transition from silent to sound and who got left behind",
    "How censorship shaped classic Hollywood storytelling",
    "The history of practical effects before CGI",
    "The auteur theory debate and its blind spots",
    "How film preservation saved cinema's memory",
    "Why widescreen transformed spectacle filmmaking",
    "The business logic of franchise cinema",
    "How documentary techniques entered narrative film",
    "The political history of the Hollywood blacklist",
    "How streaming changed the meaning of box office success"
  ],
  "boxOfficeHistory": [
    {"id":"box-001","title":"Jaws Invented the Summer Blockbuster","year":1975,"gross":"$260M (US)","context":"Universal's wide release and saturation TV marketing rewired seasonal release strategy."},
    {"id":"box-002","title":"Star Wars Turned Licensing into Core Revenue","year":1977,"gross":"$775M (global est.)","context":"Box office was only one pillar; merch and re-releases created a long-tail model."},
    {"id":"box-003","title":"Gone with the Wind's Reissue Machine","year":1939,"gross":"Record-setting across decades","context":"Periodic re-releases made the film a durable cash engine across generations."},
    {"id":"box-004","title":"The Sound of Music Kept Playing for Years","year":1965,"gross":"$286M (global est.)","context":"Roadshow engagements and sustained word-of-mouth prolonged theatrical life."},
    {"id":"box-005","title":"The Exorcist Proved Horror Could Print Money","year":1973,"gross":"$441M (global est.)","context":"Event-style fear marketing elevated horror from niche to prestige commerce."},
    {"id":"box-006","title":"E.T. Became a Family Mega-Event","year":1982,"gross":"$792M (global est.)","context":"Spielberg fused emotional storytelling with repeat-viewing economics."},
    {"id":"box-007","title":"Titanic's Legs Defied Front-Loaded Logic","year":1997,"gross":"$2.2B (global)","context":"Week-to-week holds stayed massive, proving audience growth after opening weekend."},
    {"id":"box-008","title":"The Blair Witch Project's ROI Legend","year":1999,"gross":"$248M (global)","context":"Tiny production spend plus viral mythmaking yielded one of film's wildest returns."},
    {"id":"box-009","title":"Avatar Reframed 3D Premium Economics","year":2009,"gross":"$2.9B (global)","context":"Premium format pricing and global scale reset expectations for spectacle returns."},
    {"id":"box-010","title":"Black Panther as Cultural and Box Office Event","year":2018,"gross":"$1.34B (global)","context":"Representation, critical acclaim, and repeat attendance created historic domestic strength."},
    {"id":"box-011","title":"Top Gun: Maverick Revived Legacy Theatrical","year":2022,"gross":"$1.49B (global)","context":"Multi-generational turnout proved theatrical urgency still possible post-pandemic."},
    {"id":"box-012","title":"Barbie as a Contemporary Event Film","year":2023,"gross":"$1.4B+ (global)","context":"A distinct visual identity and communal opening-weekend conversation drove momentum."}
  ]
}
